[
    {
      "pictureUrl": "https://images-na.ssl-images-amazon.com/images/I/51XyuwYrlhL.jpg",
      "name": "Avengers Action Figure Set",
      "price": "$29.99",
      "rating": 4.7,
      "details": "This Avengers Action Figure Set includes key characters from the beloved Marvel superhero team. The set features high-quality, detailed action figures of Iron Man, Captain America, Thor, Hulk, Black Widow, and Hawkeye. Each figure is approximately 6 inches tall and comes with various accessories and interchangeable parts. The figures are poseable and perfect for recreating epic battles or displaying on a collector's shelf. Suitable for children aged 4 and above, this Avengers toy set sparks imagination and provides hours of superhero fun.",
      "sellerName": "Heroic Collectibles"
    },
    {
      "pictureUrl": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2018%2F03%2Fhot-toys-avengers-infinity-war-thanos-infinity-gauntlet-life-size-collectible-00.jpg?w=960&cbr=1&q=90&fit=max",
      "name": "Avengers Infinity Gauntlet",
      "price": "$49.99",
      "rating": 4.9,
      "details": "With the Avengers Infinity Gauntlet, you can harness the power of the Infinity Stones, just like Thanos! This gauntlet is designed to fit most children's hands and features intricate details and light-up effects. By pressing the center gem, the gauntlet lights up and emits sound effects. It's the perfect accessory for any Avengers fan's costume or imaginative play. Note: This toy does not actually possess the power to alter reality or control the universe.",
      "sellerName": "Superhero Emporium"
    },
    {
      "pictureUrl": "https://images-na.ssl-images-amazon.com/images/I/81RzIObOsTL._AC_UL600_SR600,600_.jpg",
      "name": "Avengers Headquarters Playset",
      "price": "$79.99",
      "rating": 4.5,
      "details": "Create your own Avengers adventures with this interactive Headquarters Playset! The playset features multiple levels, including the command center, training area, and holding cells. It comes with action figure versions of Iron Man, Captain America, and Black Widow. The playset is packed with exciting features like a rotating missile launcher, trap doors, and sound effects. Compatible with other Avengers action figures (sold separately), this playset provides endless fun for young heroes.",
      "sellerName": "Toys R Super"
    },
    {
      "pictureUrl": "https://rukminim1.flixcart.com/image/416/416/jm81zm80/action-figure/g/e/v/8-pcs-set-marvel-avengers-infinity-war-thanos-hulk-iron-man-hulk-original-imaf8a53jvvsqepa.jpeg?q=70",
      "name": "Avengers Plush Doll Set",
      "price": "$19.99",
      "rating": 4.8,
      "details": "Cuddle up with your favorite Avengers superheroes with this plush doll set! The set includes huggable plush versions of Iron Man, Captain America, Thor, Hulk, Black Widow, and Hawkeye. Each doll is approximately 10 inches tall and made with soft, durable materials. Perfect for both playtime and bedtime, these plush dolls bring comfort and fun to Avengers fans of all ages.",
      "sellerName": "Marvel Merchandise Store"
    },
    {
      "pictureUrl": "https://static.wikia.nocookie.net/lego/images/6/68/LEGO_76166_alt1.jpg/revision/latest?cb=20200604025547",
      "name": "Avengers Battle Vehicles Set",
      "price": "$39.99",
      "rating": 4.6,
      "details": "Get ready for epic battles with the Avengers Battle Vehicles Set! This set includes miniature versions of the Quinjet, the Avengers' iconic jet, and the Avengers' off-road vehicle. Both vehicles are highly detailed and come with movable parts and launching mechanisms. The set also includes action figures of Iron Man, Captain America, and Black Widow. Combine the vehicles and figures to create thrilling missions and adventures.",
      "sellerName": "Superhero Toy World"
    },
    {
      "pictureUrl": "https://i.pinimg.com/originals/3b/28/65/3b2865d0db85bbccf1644f368213d3af.jpg",
      "name": "Avengers Hero Mask Collection",
      "price": "$14.99",
      "rating": 4.4,
      "details": "Transform into your favorite Avenger with the Hero Mask Collection! This set includes masks of Iron Man, Captain America, Thor, Hulk, Black Widow, and Hawkeye. Each mask features a comfortable elastic strap and is designed for both children and adults. Whether for costume parties, imaginative play, or cosplay events, these masks let you embody the heroic spirit of the Avengers.",
      "sellerName": "Masked Heroes Emporium"
    },
    {
      "pictureUrl": "https://example.com/avengers-toy-7.jpg",
      "name": "Avengers LEGO Set: Battle for New York",
      "price": "$59.99",
      "rating": 4.7,
      "details": "Relive the iconic Battle for New York with this Avengers LEGO Set! Recreate the epic battle scene from the Avengers movie with mini-figures of Iron Man, Captain America, Thor, Hulk, Black Widow, Loki, and Chitauri warriors. The set includes the Avengers Tower, Chitauri chariot, and various accessories. With its detailed construction and action-packed features, this LEGO set is a must-have for Marvel and LEGO enthusiasts.",
      "sellerName": "Brick Avengers"
    },
    {
      "pictureUrl": "https://pbs.twimg.com/media/D0_Iz2LWwAAfErx.jpg",
      "name": "Avengers Roleplay Armor Set",
      "price": "$34.99",
      "rating": 4.5,
      "details": "Gear up and become an Avenger with the Roleplay Armor Set! This set includes a chest plate, gauntlets, and a helmet inspired by the iconic Avengers characters. Each piece is made with lightweight, durable materials and features intricate details. The armor set is adjustable to fit most children and enhances imaginative play and superhero-themed events.",
      "sellerName": "Superhero Gear Shop"
    },
    {
      "pictureUrl": "https://cdn.shopify.com/s/files/1/0631/9970/7391/products/07722c-1.jpg?v=1653845481",
      "name": "Avengers Puzzle Collection",
      "price": "$12.99",
      "rating": 4.3,
      "details": "Challenge your problem-solving skills with the Avengers Puzzle Collection! This set includes four different puzzles featuring your favorite Avengers characters. Each puzzle has a varying number of pieces and difficulty level, suitable for both children and adults. Made with high-quality materials, these puzzles provide hours of entertainment and can be framed for display once completed.",
      "sellerName": "Puzzle Planet"
    },
    {
      "pictureUrl": "https://cdnqa.toysrusmena.com/img/TRU/QAT/Catalogs/toysrus-master-catalog/en_QA/large/2128717_103@3x.jpg",
      "name": "Avengers Laser Tag Battle Set",
      "price": "$49.99",
      "rating": 4.6,
      "details": "Engage in exciting laser tag battles with the Avengers Laser Tag Battle Set! The set includes two laser blasters featuring Avengers-themed designs and sound effects. Strap on the adjustable target vests and challenge your friends or family to epic laser tag battles. The blasters have multiple firing modes and adjustable power settings. With its Avengers-inspired design, this laser tag set guarantees hours of action-packed fun.",
      "sellerName": "Battle Zone Games"
    }
  ]
  